API_Transaction/app/controllers/transactions_controller.rb

  def create
    @transaction = Transaction.new(transaction_params)
    sender = User.find(@transaction.sender_id)

    # Verificar que el usuario que envía tiene suficiente en su wallet
    balance_validation = !sender.validate_balance(@transaction.coin_to_send, @transaction.amount_to_send)
    if balance_validation
      render json: { error: 'Balance insuficiente' }, status: 400
    else
      coin_to_send = @transaction.coin_to_send
      coin_to_receive = @transaction.coin_to_receive
      amount_to_send = @transaction.amount_to_send

      # Es posible hacer una transferencia de la misma moneda
      if coin_to_send == coin_to_receive
        @transaction.amount_to_receive = amount_to_send

      # Si la moneda que se envía es diferente a la que se recibe, hay que hacer la conversión
      # Y usar la API CoinGecko
      else
        if coin_to_receive == 'btc'
          # Para convertir de usd a btc se multiplica la cantidad que se envía por 1 entre el valor de conversión
          @transaction.amount_to_receive = amount_to_send * (1.0 / @usd_convert)
        else
          # Para convertir de btc a usd se multiplica la cantidad que se envía por el valor de conversión
          @transaction.amount_to_receive = amount_to_send * @usd_convert
        end
      end

      if @transaction.save
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
UPDATE "users" SET "btc_wallet" = 12.0001829123301201734, "updated_at" = '2025-05-23 17:22:02.839036' WHERE "users"."id" = 3
INSERT INTO "transactions" ("coin_to_send", "coin_to_receive", "amount_to_send", "amount_to_receive", "sender_id", "receiver_id", "created_at", "updated_at") VALUES ('usd', 'btc', 10.0, 0.00009174311926605504, 2, 3, '2025-05-23 18:54:04.454180', '2025-05-23 18:54:04.454180') RETURNING "id"

  def destroy
    @transaction.destroy!
---
DELETE FROM "transactions" WHERE "transactions"."id" = $1  [["id", 998]]

    def set_transaction
      @transaction = Transaction.find(params.expect(:id))
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = 15 LIMIT 1