API_Transaction/app/controllers/transactions_controller.rb

  def create
    @transaction = Transaction.new(transaction_params)
    sender = User.find(@transaction.sender_id)

    if @transaction.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
INSERT INTO "transactions" ("coin_to_send", "coin_to_receive", "amount_to_send", "amount_to_receive", "sender_id", "receiver_id", "created_at", "updated_at") VALUES ('usd', NULL, 0.13, NULL, 1, 2, '2025-05-22 22:42:01.050437', '2025-05-22 22:42:01.050437') RETURNING "id"

  def update
    if @transaction.update(transaction_params)
---
UPDATE "transactions" SET "coin_to_send" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["coin_to_send", "btc"], ["updated_at", "2025-05-23 13:11:26.240345"], ["id", 931]]