API_Transaction/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "btc_wallet", "usd_wallet", "created_at", "updated_at") VALUES ('Alejandra', 0.00192734, 100.12, '2025-05-22 21:12:09.509823', '2025-05-22 21:12:09.509823') RETURNING "id"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = '0', "updated_at" = '2025-05-22 21:15:35.418606' WHERE "users"."id" = 1

    def set_user
      @user = User.find(params.expect(:id))
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1